Repository: jopakka/InMotion
Catalog: InMotion/Storyboards/*.lproj/Localizable.strings
Languages: fi

# note_placeholder
source: Here you can write notes for memory...
fi: Tänne voit kirjoittaa muistiinpanoja muistosta...

source: Save
fi: Tallenna

source: Cancel
fi: Peruuta

source: Error
fi: Virhe

source: No location
fi: Ei sijaintia

# no_title
source: Title can't be empty
fi: Otsikko ei voi olla tyhjä

# no_image
source: Missing image
fi: Kuva puuttuu

source: Success
fi: Onnistui

source: Memory saved
fi: Muisto tallennettu

# error_saving_memory
source: Error while saving memory
fi: Virhe tallennettaessa muistoa

source: Warning
fi: Varoitus

# memory_will_not_be_saved
source: Memory will not be saved. Do you still wanna continue?
fi: Muistoa ei tallenneta. Haluatko jatkaa?

source: Yes
fi: Kyllä

source: No
fi: Ei

# not_work_in_sim
source: This does not work in simulator
fi: Tämä ei toimi simulaattorilla

# need_location_permission
source: Location services are disabled. In order to record a journey you need to go to settings and enable location for InMotion app
fi: Sijaintipalvelut ovat pois käytöstä. Tallentaaksesi matkan, mene asetuksiin ja salli sijainti sovellukselle.

# cannot_continue_without_location
source: Cannot proceed without location permissions
fi: Ei pysty jatkamaan ilman lupaa

source: Back to home
fi: Takaisin

# go_to_settings
source: Take me to settings
fi: Mene asetuksiin

# username_length_error
source: Username must be atleast 3 characters long.
fi: Käyttäjänimen täytyy olla vähintään 3 merkkiä pitkä.

# password_length_error
source: Password must be atleast 6 characters long.
fi: Salasanan täytyy olla vähintään 6 merkkiä pitkä.

# passwords_not_match
source: Passwords doesn't match.
fi: Salasanat eivät täsmää.

# user_creating_error_title
source: Errors while creating user
fi: Virhe luodessa käyttäjää

# username_exists
source: Username already exists
fi: Käyttäjänimi käytössä

source: Wrong username or password
fi: Väärä käyttäjänimi tai salasana

# there_was_error
source: There was some error
fi: Tapahtui virhe

source: Distance Travelled
fi: Kuljettu matka

source: Time Spent Travelling
fi: Kulutettu aika

source: Total CO2 Emmissions
fi: Kokonais CO2 kulutus

# not_working
source: This is not working. I tried my best :(
fi: Tämä ei toimi. Yritin parhaani :(

# no_name
source: Name can't be empty
fi: Nimi ei voi olla tyhjä

# daily_breakout
source: Daily Travel Breakdown
fi: Päivän matkat
